In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame

#### 替换操作
  - 替换操作可以同步作用于Series和DataFrame中
  - 单值替换
    - 普通替换: 替换所有符合要求的元素: to_replace=15,value='e'
    - 按照指定单值替换: to_replace={列标签: 替换值} value='value'
  - 多值替换
    - 列表替换: to_replace=[] value=[]
    - 字典替换(推荐) to_replace=(to_replace:value,to_replace:value)

In [2]:
df = DataFrame(np.random.randint(0,100,size=(5,6)))
df

    0   1   2   3   4   5
0  16  91   8  33  34  83
1  84  62  86  74  70  26
2  83  27  17  45  15  11
3   3  18  18  38  36  75
4  91  93  19  51  29  34

In [6]:
df.replace(to_replace=16,value='Two') # 把16的值都进行替换

     0   1   2   3   4   5
0  Two  91   8  33  34  83
1   84  62  86  74  70  26
2   83  27  17  45  15  11
3    3  18  18  38  36  75
4   91  93  19  51  29  34

In [7]:
df.replace(to_replace={62:'John'}) # 把62的值都进行替换

    0     1   2   3   4   5
0  16    91   8  33  34  83
1  84  John  86  74  70  26
2  83    27  17  45  15  11
3   3    18  18  38  36  75
4  91    93  19  51  29  34

In [14]:
df.replace(to_replace={2:17},value='five') # 将2列的17替换为five
# 将指定列的元素进行替换to_replace={列标签: 被替换值} value='value'

    0   1     2   3   4   5
0  16  91     8  33  34  83
1  84  62    86  74  70  26
2  83  27  five  45  15  11
3   3  18    18  38  36  75
4  91  93    19  51  29  34

### 映射操作
  - 概念: 创建一个映射关系列表,把values元素和一个特定的标签或者字符串绑定(给一个元素值提供不同的表现形式)
  - 创建一个df,两列分别是姓名和薪资,然后给其名字起对应的英文名

In [17]:
dic = {
    'name': ['John','Jack','Tom','Marry','Zack'],
    'salary': [10000,4500,8000,6000,7000]
}
df = DataFrame(dic)
df

    name  salary
0   John   10000
1   Jack    4500
2    Tom    8000
3  Marry    6000
4   Zack    7000

In [21]:
# 创建一个映射关系列表
dic = {
    'John': '约翰',
    'Jack': '杰克',
    'Tom': '汤姆',
    'Marry': '玛丽',
    'Zack': '扎克'
}
df['e_name'] = df['name'].map(dic) # 将name列的值进行映射
df

    name  salary e_name
0   John   10000     约翰
1   Jack    4500     杰克
2    Tom    8000     汤姆
3  Marry    6000     玛丽
4   Zack    7000     扎克